var Validation = (function(){

    return {

    }
})();
window.validation = Validation;
/*
 1.Наличие данный в форме  (событие от пользователя)
    - есть ли форма на странице, какая конкретная форма
    - проверка какие есть поля в форме
    - отбираем валидируемые
    - запускаем проверку <===  результат (2.)
    - проверка результата
    - если ок то отправляем на сревер
    -если все плохо, то выводим ошибку

 2. Корректность ввода данных согласно требованиям
     - взять данные
     - взять требования
     - сравниваем
     - результать (валидно или нет)

 */